
import { getProfile } from "@/services/authServices"
import { useQuery } from "@tanstack/react-query"


export const useGetProfile=()=>{
const {data,isPending}=useQuery({
    queryKey:["get-user"],
    queryFn:getProfile,

    // ری اکت کویری در صورت شکست ریکویست میاد سه بار اون رو تکرار میکنه ما اینجا
    // این رو فالس گذاشتیم تا فقط یک درخواست بره که کاربر اگر اکسس توکن و رفرش توکن نداشت دیگه درخواست نره
    retry:false
});


return {data,isPending}
};


// رو چه حسابی ما میتونیم اطلاعات کاربر رو بگیریم و نمایش بدیم با این تابع
// در اچ تی تی پی ریکویست ما کردنشیال رو ترو گذاشیتم
// بکند به کوکی دسترسی داشته باشه و با ارسال درخواست کوکی تو هدر ست میشه اکسس توکن و رفرش توکن رو در کوکی ذخیره میکنه از سمت بکند
// ما در فرانت به کوکی دسترسی نداریم برای امنیت

// خب وقتی کاربر لاگین میکنه یک اکسس توکن و رفرش توکن بهش تعلق میگیره
// وفتی اینجا درخواست میزنیم به بکند برای گرفتن اطلاعات کاربر رفرش توکن و اکسس توکن هم ارسال میشه
// بکند از این طریق متوجه میشه اطلاعات کدوم کاربر رو بفرسته
